name: "SAHI_YOLO11_POSE_ENSEMBLE"
backend: "sahi_ensemble"
max_batch_size: 0

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [-1, -1, -1, 3]
  }
]

output [
  { name: "num_dets", data_type: TYPE_INT32, dims: [1] },
  { name: "detection_boxes", data_type: TYPE_FP32, dims: [300, 4] },
  { name: "detection_scores", data_type: TYPE_FP32, dims: [300] },
  { name: "detection_classes", data_type: TYPE_INT32, dims: [300] },
  { name: "detection_keypoints", data_type: TYPE_FP32, dims: [300, 17, 3] }
]

parameters: {
  key: "output_type"
  value: { string_value: "pose" }
}
parameters: {
  key: "detector_model"
  value: { string_value: "YOLO11_POSE_PRE_ENSEMBLE" }
}
parameters: {
  key: "conf_threshold"
  value: { string_value: "0.25" }
}
parameters: {
  key: "iou_threshold"
  value: { string_value: "0.45" }
}
parameters: {
  key: "max_detections"
  value: { string_value: "300" }
}
parameters: {
  key: "chunk_size"
  value: { string_value: "16" }
}
parameters: {
  key: "num_classes"
  value: { string_value: "1" }
}
parameters: {
  key: "num_keypoints"
  value: { string_value: "17" }
}
parameters: {
  key: "slice_width"
  value: { string_value: "640" }
}
parameters: {
  key: "slice_height"
  value: { string_value: "640" }
}
parameters: {
  key: "overlap_width_ratio"
  value: { string_value: "0.2" }
}
parameters: {
  key: "overlap_height_ratio"
  value: { string_value: "0.2" }
}
parameters: {
  key: "max_slices"
  value: { string_value: "64" }
}

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]
  }
]
