name: "yolo11_obb_ensemble"
platform: "ensemble"
max_batch_size: 16

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
  }
]

output [
  { name: "num_dets", data_type: TYPE_INT32, dims: [1] },
  { name: "detection_boxes", data_type: TYPE_FP32, dims: [300, 5] },
  { name: "detection_scores", data_type: TYPE_FP32, dims: [300] },
  { name: "detection_classes", data_type: TYPE_INT32, dims: [300] },
  { name: "transform_metadata", data_type: TYPE_FP32, dims: [6] }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "raw_image"
        value: "raw_image"
      }
      output_map {
        key: "preprocessed_output"
        value: "preprocessed_output"
      }
      output_map {
        key: "transform_metadata"
        value: "transform_metadata"
      }
    },
    {
      model_name: "yolo11_obb"
      model_version: -1
      input_map {
        key: "images"
        value: "preprocessed_output"
      }
      output_map {
        key: "output0"
        value: "output0"
      }
    },
    {
      model_name: "yolo11_obb_postprocess"
      model_version: -1
      input_map {
        key: "model_output"
        value: "output0"
      }
      output_map {
        key: "num_dets"
        value: "num_dets"
      }
      output_map {
        key: "detection_boxes"
        value: "detection_boxes"
      }
      output_map {
        key: "detection_scores"
        value: "detection_scores"
      }
      output_map {
        key: "detection_classes"
        value: "detection_classes"
      }
    }
  ]
}
