name: "CLASSIFIER_SMOKING_ENSEMBLE"
platform: "ensemble"
max_batch_size: 16

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
  }
]

output [
  {
    name: "classes"
    data_type: TYPE_INT32
    dims: [2]
  },
  {
    name: "scores"
    data_type: TYPE_FP32
    dims: [2]
  },
  {
    name: "transform_metadata"
    data_type: TYPE_FP32
    dims: [6]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "CLASSIFIER_224_DIRECT_COMMON"
      model_version: -1
      input_map {
        key: "raw_image"
        value: "raw_image"
      }
      output_map {
        key: "preprocessed_output"
        value: "preprocessed_output"
      }
      output_map {
        key: "transform_metadata"
        value: "transform_metadata"
      }
    },
    {
      model_name: "CLASSIFIER_SMOKING"
      model_version: -1
      input_map {
        key: "input"
        value: "preprocessed_output"
      }
      output_map {
        key: "output"
        value: "logits"
      }
    },
    {
      model_name: "CLASSIFIER_SMOKING_POSTPROCESS"
      model_version: -1
      input_map {
        key: "logits"
        value: "logits"
      }
      output_map {
        key: "classes"
        value: "classes"
      }
      output_map {
        key: "scores"
        value: "scores"
      }
    }
  ]
}
